Repository: AntoneseiCristian/AI-Powered-Fitness-Assistant-with-WhatsApp-Integration
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ro

source: Weight in kg
ro: Greutate în kg

source: Height in cm
ro: Înălțime în cm

source: Calculate BMI
ro: Calculează IMC

source: Your BMI is:
ro: Indicele tău de masă corporală este:

source: You are underweight. It's recommended to consult a nutritionist for a balanced diet plan.
ro: Ești subponderal. Se recomandă consultarea unui nutriționist pentru un plan alimentar echilibrat.

source: You have a normal weight. Keep maintaining a balanced diet and regular physical activity.
ro: Ai o greutate normală. Continuă să menții o dietă echilibrată și o activitate fizică regulată.

source: You are overweight. Consider a balanced diet and regular physical activity. Consult a healthcare professional if needed.
ro: Ești supraponderal. Ia în considerare o dietă echilibrată și activitate fizică regulată. Consultă un medic dacă este necesar.

source: You are in the obesity range. It's highly recommended to consult a healthcare professional for guidance and support.
ro: Ești în categoria obezității. Este foarte recomandat să consulți un medic pentru îndrumare și sprijin.

source: Don't have an account? Register
ro: Nu ai un cont? Înregistrează-te

source: Please log in to access this page.
ro: Te rog să te autentifici pentru a accesa această pagină.

source: Welcome to the BMI App
ro: Bine ai venit la Aplicația BMI

source: Username
ro: Nume de utilizator

source: Password
ro: Parolă

source: Log In
ro: Autentificare

source: Register
ro: Înregistrare

source: Confirm Password
ro: Confirmă Parola

source: Already have an account? Log In
ro: Ai deja un cont? Autentificare

source: Logout
ro: Deconectare

source: Your latest BMI was calculated on
ro: Ultimul tău IMC a fost calculat pe

source: Don't have an account?
ro: Nu ai cont?
